from flask import Flask
from bot import bot
import asyncio
import threading
from pyrogram import idle

app = Flask(__name__)

@app.route('/')
def hello_world():
    return 'TechifyBots is Running!'

def run_bot():
    """బ్యాక్‌గ్రౌండ్‌లో బాట్‌ను రన్ చేసే ఫంక్షన్"""
    loop = asyncio.new_event_loop()
    asyncio.set_event_loop(loop)
    
    # బాట్‌ను స్టార్ట్ చేయడం
    loop.run_until_complete(bot.start())
    print("టెలిగ్రామ్ బాట్ స్టార్ట్ అయ్యింది! 🎉")
    
    # బాట్ ఆన్లైన్‌లో ఉండటానికి idle అవసరం
    loop.run_until_complete(idle())

# బాట్‌ను విడిగా ఒక థ్రెడ్‌లో స్టార్ట్ చేయడం
# ఇది వెబ్ సర్వర్‌తో సంబంధం లేకుండా రన్ అవుతుంది
threading.Thread(target=run_bot, daemon=True).start()

# ఇక్కడ app.run() ఉండకూడదు. 
# ఎందుకంటే Render 'gunicorn app:app' ద్వారా సర్వర్‌ను రన్ చేస్తుంది.
